# 01 Importing Libraries

In [1]:
#import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# 02 Importing Data

In [2]:
#defining path
path = r'C:\Users\User\OneDrive\Dokumentumok\CF\Phyton\Instacart Basket Analysis'

In [3]:
#importing data (customers.csv )
customer = pd.read_csv(r'C:\Users\User\OneDrive\Dokumentumok\CF\Phyton\Instacart Basket Analysis\02 Data\Original Data\customers.csv')

In [24]:
customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [4]:
customer.shape

(206209, 10)

# 03 Tasks

#### 04 Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that donâ€™t add anything to your analysis.

In [5]:
# I think date_joined column isn't needed
# drop column
customer.drop(columns = ['date_joined'])

,user_id,First Name,Surnam,Gender,STATE,Age,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1,married,40374
...,...,...,...,...,...,...,...,...,...
206204,168073,Lisa,Case,Female,North Carolina,44,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,1,married,57095

In [6]:
#inplace mean it will overwite with the new name and not make a copy ith the new name
customer.rename(columns = {'Surnam' : 'Surname'}, inplace = True)

#### 05 Complete the fundamental data quality and consistency checks youâ€™ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [7]:
customer.columns

Index(['user_id', 'First Name', 'Surname', 'Gender', 'STATE', 'Age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

In [30]:
#finding missing values
missing_values = customer.isnull().sum()

print("Missing values in the columns: ")
print(missing_values)

Missing values in the columns:
user_id             0
First Name      11259
Surname             0
Gender              0
STATE               0
Age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

In [31]:
#finding duplicates
duplicate_rows = customer[customer.duplicated()]

In [32]:
print (duplicate_rows)

Empty DataFrame
Columns: [user_id, First Name, Surname, Gender, STATE, Age, date_joined, n_dependants, fam_status, income]
Index: []

In [ ]:
#there are no duplicates

In [33]:
#check data types
customer.dtypes

user_id          int64
First Name      object
Surname         object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [40]:
#no need to change data types

#### 06 Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [8]:
#importing data (customers.csv )
ords_prods_merge = pd.read_pickle(r'C:\Users\User\OneDrive\Dokumentumok\CF\Phyton\Instacart Basket Analysis\02 Data\Prepared Data\orders_products_merged_4_8.pkl')

In [11]:
#drop rows with missing values
ords_prods_merge = ords_prods_merge.dropna(subset=['user_id'])

In [9]:
ords_prods_merge.dtypes

product_id                         int64
product_name                      object
aisle_id                         float64
department_id                    float64
prices                           float64
order_id                         float64
user_id                          float64
order_number                     float64
orders_day_of_week               float64
order_time_of_day                float64
days_since_prior_order           float16
add_to_cart_order                float64
reordered                        float64
price_range_loc                   object
busiest_day                       object
busiest_days                      object
busiest_period_of_day             object
max_order                        float64
loyalty_flag                      object
mean_prices                      float64
spender_type                      object
median_days_since_prior_order    float16
customer_frequency                object
dtype: object

In [12]:
#changing the data types
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('int32')

In [13]:
customer['user_id'] = customer['user_id'].astype('int32')

In [14]:
# Attemp a merge
# df3 = df1.merge(df2, on = [user_id], how = 'outer', indicator = True)
ords_prods_merge_final = ords_prods_merge.merge(customer, on = ['user_id'],  how = 'outer', indicator = True)

In [15]:
ords_prods_merge_final.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,...,First Name,Surname,Gender,STATE,Age,date_joined,n_dependants,fam_status,income,_merge
0,1,Chocolate Sandwich Cookies,61.0,19.0,5.8,3139998.0,138,28.0,6.0,11.0,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61.0,19.0,5.8,1977647.0,138,30.0,6.0,17.0,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,907,Premium Sliced Bacon,106.0,12.0,20.0,3160996.0,138,1.0,5.0,13.0,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
3,907,Premium Sliced Bacon,106.0,12.0,20.0,2254091.0,138,10.0,5.0,14.0,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
4,1000,Apricots,18.0,10.0,12.9,505689.0,138,9.0,6.0,12.0,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both

In [16]:
#Confirm the results of the merge using the merge flag.
ords_prods_merge_final['_merge'].value_counts()

_merge
both          32435059
left_only            0
right_only           0
Name: count, dtype: int64

# Export pickle

In [17]:
ords_prods_merge_final.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged_final.pkl'))

In [3]:
customer = pd.read_pickle(r'C:\Users\User\OneDrive\Dokumentumok\CF\Phyton\Instacart Basket Analysis\02 Data\Prepared Data\orders_products_merged_final.pkl')